unklstewy/espTari/test_apps/st_hardware_test/sdkconfig.defaults
# Target: ESP32-P4
CONFIG_IDF_TARGET="esp32p4"

# PSRAM support
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# Disable PMP IDRAM split to allow executable memory allocation
CONFIG_ESP_SYSTEM_PMP_IDRAM_SPLIT=n

# SD/MMC configuration
CONFIG_SOC_SDMMC_USE_GPIO_MATRIX=y

# FAT filesystem
CONFIG_FATFS_VFS_FSTAT_BLKSIZE=4096
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
